#include <S3C2440.h>  //这个文件由汇编器提供,里面的内容全都是S3C2440芯片的寄存器地址宏

void CtrlLED(void) //CtrlLED函数定义
{
	GPBCON = (1 << 10) | (1 << 12) | (1 << 14) | (1 << 16);	// 通过GPBCON对BPB进行配置,[11,10]位为BPB5配置位,[13,12]位为BPB6配置位,[15,14]位为BPB7配置位,[17,16]位为BPB8配置位,01为输出模式，就是将BPB{5,6,7,8}配置为输出模式,为什么是BPB{5,6,7,8}呢,因为从原理图中可以得知,它们分别与LED{1,2,3,4}直连
	GPBDAT = (1 << 5) | (1 << 6) | (1 << 7) | (1 << 8);	//将BPB{5,6,7,8}配置为高电平的时候就使LED{1,2,3,4}灯灭
	GPBDAT = (0 << 5) | (0 << 6) | (0 << 7) | (0 << 8);	//将BPB{5,6,7,8}配置为低电平的时候就使LED{1,2,3,4}灯亮
}
 
 void delay(int n) //延时函数定义
 {
    int i,j; 
 	for(i=0;i<n;i++)   //第一层循环n次
	for(j=0;j<n;j++);	//第二层循环n次,所以总共有n*n次空操作

 }

 void CtrlBEEP(void) //CtrlBEEP函数定义
 {	 

    GPBCON |= 0x01;	// 将GPB0配置为输出,为什么配置GPB0呢,因为BPB0直连着蜂鸣器，并且如果输出高电平,就联通
	
    while(1) //死循环
	{
		GPBDAT &= 0xfffffffe;	//将0位置0,低电平,所以不会响
		delay(100); 			//适当延时10000个处理周期
		GPBDAT |= 1;	   		//将0位置1,高电平,所以会响
		delay(100);				//适当延时10000个处理周期
	}
 }